Repository: temurz/AkfaSmart
Catalog: AkfaSmart/*.lproj/Localizable.strings
Languages: uz

source: MAIN
uz: ASOSIY

source: My cards
uz: Mening kartalarim

source: BONUS CARD
uz: BONUS KARTA

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Filter
uz: Filtr

source: Home
uz: Asosiy

source: Search
uz: Qidirish

source: My dealers
uz: Mening dilerlarim

source: Dealer:
uz: Diler:

# TOTAL_OF_PRODUCTS_SHOULD_BE
source: total of these products should be
uz: mahsulotlarning ja'mi xaridi bo'lishi kerak

# MIN
source: minimum
uz: eng kamida

# MAX
source: maximum
uz: eng kopi

source: Purchases(kg)
uz: Xaridlar(kg)

source: Additional terms
uz: Qo'shimcha shartlar

source: Total of products should be maximum
uz: maxsulotlarning jami haridi eng ko'pi

source: Dealers with this product
uz: Ushbu mahsulot bor bo'lgan dilerlar

source: By Annual purchase
uz: Yillik xaridi bo'yicha

# DEALERS_NOT_ADDED
source: You didn't add dealers yet!
uz: Siz diler qo'shmagansiz!

source: My class
uz: Mening sinfim

source: Messages
uz: Chat

source: News
uz: Yangiliklar

source: Articles
uz: Kataloglar

source: Your status
uz: Sizning holatingiz

source: Detail
uz: Batafsil

source: Total
uz: Umumiy

source: Married
uz: Uylangan

source: Single
uz: Uylanmagan

source: sq.m
uz: kv.m

source: Dealer's name
uz: Diler ismi

source: Balance:
uz: Balans:

# SUM_UZS
source: sum
uz: uzs

source: Sum of bought goods:
uz: Mahsulotlar xaridi(uzs):

source: For month
uz: Oylik

source: For year
uz: Yillik

source: History of purchases
uz: Sotib olish tarixi

source: History of payments
uz: To'lov tarixi

source: Client:
uz: Mijoz:

source: Income
uz: Kirim

source: Outcome
uz: Qaytarish

# PAYMENT_HISTORY_TITLE
source: Payment history
uz: To'lov tarixi

source: Amount:
uz: Miqdori:

source: Price:
uz: Narxi:

# TOTAL_WITH_COLON
source: Total:
uz: Umumiy:

source: uzs
uz: so'm

# ORDER_WITH_NUMBER
source: Order №
uz: Buyurtma №

source: More
uz: Batafsil

# PURCHASE_HISTORY_TITLE
source: Purchase history
uz: Sotib olish tarixi

source: Clear
uz: Tozalash

source: Date of start
uz: Boshlanish sanasini tanlang

source: Date of end
uz: Tugash sanasini tanlang

source: Type of Articles
uz: Katalog turi

source: Select article type
uz: Katalog turini tanlang

# GROUP_WITH_COLON
source: Group:
uz: Guruh:

source: Search product
uz: Mahsulotni qidirish

source: Welcome!
uz: Xush kelibsiz!

source: Add my dealer
uz: Mening dilerimni biriktirish

source: Dismiss
uz: Bekor qilish

# CAN_ADD_DEALER_BY_SCAN
source: You can add the dealer by scanning qr-code or by entering bar-code
uz: Skanerlash yoki shtrix-kod kiritish orqali dilerni bog'lay olasiz

source: Code
uz: Kod

source: Phone number
uz: Telefon raqami

source: Confirm
uz: Tasdiqlash

source: Skip
uz: O'tkazib yuborish

source: Text
uz: Matn

# IS_OFFICE_OR_SHOWROOM
source: Is there an office or showroom
uz: Ofis yoki shourum bormi

source: Office
uz: Ofis

# OR_SHOWROOM
source: / showroom
uz: / shourum

source: Annual business growth
uz: Yillik biznes rivojlanishi

source: Annual sales turnover
uz: Yillik savdo aylanishi

source: Uses advertising
uz: Reklamadan foydalanadimi

source: No information
uz: Ma'lumot yo'q

source: Uses outdoor advertising
uz: Tashqi reklamalar soni

source: Marketing graphics
uz: Marketing grafiklari

source: Annual buy amount
uz: Yillik sotib olish miqdori

source: Annual buy weight
uz: Yillik sotib olish og'irligi

source: Dealer names
uz: Dilerlar ismlari

# PRODUCT_GRAPHICS_TITLE
source: Product Graphics
uz: Mahsulot grafiklari

# FIO
source: Full name
uz: To'liq ism

source: Date of birth
uz: Tug'ilgan sana

source: Address
uz: Manzil

source: Nationality
uz: Millati

source: Education
uz: Ta'lim

source: Family
uz: Oilaviy holati

# CHILDREN_EN
source: children
uz: bolasi bor

source: Foreign languages
uz: Chet tillar

source: Infographics
uz: Infografikalar

source: Edit
uz: Tahrirlash

source: Number of employees
uz: Xodimlar soni

source: About employees
uz: Xodimlar haqida

source: Is there a seller
uz: Sotuvchi (bor/yo'q)

source: Is there an accountant
uz: Hisobchi (bor/yo'q)

# HR_GRAPHICS_TITLE
source: HR graphics
uz: HR grafiklari

source: Address of factory
uz: Seh manzili

source: Area of factory
uz: Seh maydoni

# GLASS_FACTORY_EXISTS
source: Glass factory (exists/no)
uz: Oyna zavodi (mavjud/yo'q)

source: Which series uses
uz: Qaysi seriyadan foydalaniladi

source: Which tools uses
uz: Qaysi uskunalardan foydalaniladi

# TECHNOGRAPHICS_TITLE
source: Technographics
uz: Texnografika

# LANGUAGE_TITLE
source: Language
uz: Til

source: Save
uz: Saqlash

source: Delete account
uz: Akkauntni o'chirish

source: Use gallery
uz: Galereyani ochish

source: Use camera
uz: Kamerani ochish

source: Close
uz: Yopish

# SETTINGS_TITLE
source: Settings
uz: Sozlamalar

source: Reset password
uz: Parolni qayta o'rnatish

# CREATE_PASSWORD
source: Create a new password
uz: Yangi parol yaratish

source: New password
uz: Yangi parol

source: Confirm new password
uz: Yangi parolni tasdiqlang

# PASSWORDS_SHOULD_BE_SAME
source: Two passwords should be the same
uz: Ikki parol bir xil bo'lishi kerak

# FORGOT_PASSWORD_QUESTION
source: Forgot password?
uz: Parolni unutdingizmi?

# ENTER_PHONE_NUMBER_RESET_PASSWORD
source: Enter your phone number in order to reset your password
uz: Parolni qayta tiklash uchun telefon raqamingizni kiriting

# CODE_SENT_TO_PHONE
source: One-time code was sent to %@
uz: Ushbu %@ mobil raqamga tasdiqlash kodi yuborildi

source: SMS code
uz: SMS kodi

source: Resend code in:
uz: Kodni qayta yuborish:

source: Resend SMS
uz: SMS-ni qayta yuborish

source: Registration
uz: Ro'yxatdan o'tish

source: Forgot password
uz: Parolni unutdingizmi?

source: Add dealer
uz: Diler qo'shish

source: Register
uz: Ro'yxatdan o'tish

source: Confirm password
uz: Parolni tasdiqlang

source: Already registered
uz: Ro'yxatdan o'tib bo'lganman

source: Login
uz: Kirish

source: Password
uz: Parol

source: Please enter user name
uz: Iltimos, telefon raqamni kiriting

# PHONE_NUMBER_SHOULD_BE_IN_FORMAT
source: The phone number should be in +998(**) ***-**-** format
uz: Telefon raqami +998(**) ***-**-** formatida bo'lishi kerak

# MINIMUM_NUMBER_OF_LETTERS
source: Password length must be more than 6 characters
uz: Parol uzunligi 6 ta belgidan ko'p bo'lishi kerak

source: Please enter password
uz: Iltimos, parolni kiriting

source: Code cannot be empty
uz: Kod bo'sh bo'lishi mumkin emas

source: Phone number cannot be empty
uz: Telefon raqami bo'sh bo'lishi mumkin emas

source: Personal data
uz: Shaxsiy ma'lumotlar

source: Technographics
uz: Texnografika

source: HR graphics
uz: HR grafika

source: Market graphics
uz: Market grafika

source: Product graphics
uz: Mahsulot grafika

source: Technical support
uz: Texnik yordam

source: PIN-code
uz: PIN-kod

source: Language
uz: Til

# CHAT_IS_EMPTY
source: You have no messages
uz: Sizda xatlar yo'q

source: List is empty
uz: Ro'yxat bo'sh

source: First name
uz: Ismi

source: Middle name
uz: Otasining ismi

source: Last name
uz: Familiyasi

source: Is married
uz: Uylangan/Turmushga chiqqan

source: Region
uz: Hudud

# HAS_CHILDREN_QUESTION
source: Has children
uz: Bolalari

source: Tools
uz: Uskunalar

source: Choose on map
uz: Xaritada tanlang

source: Article name
uz: Katalog nomi

# OUTCOME_PAYMENT
source: Outcome
uz: Chiqim

# INCOME_PAYMENT
source: Income
uz: Kirim

# CREATE_NEW_PIN_TITLE
source: Create a new PIN
uz: Yangi PIN yaratish

# REPEAT_PIN_TITLE
source: Repeat the PIN
uz: PIN-kodni takrorlang

# ENTER_PIN_SIMPLE_TITLE
source: Enter the PIN
uz: Ilovaga kirish uchun PIN-kodni kiriting

# OLD_PIN_TITLE
source: Enter old PIN
uz: Eski PIN-kodni kiriting

# REMOVE_PIN_TITLE
source: Enter PIN, to remove the PIN
uz: PIN-kodni o'chirish uchun eski PIN-kodni takrorlang

# PIN_CODE_VIEW_TITLE
source: PIN code
uz: PIN-kod

# CREATE_NEW_PIN_ON_AUTH
source: Create a new PIN
uz: Yangi PIN yaratish

# WRONG_PIN_CODE
source: The PIN is wrong!
uz: Noto'g'ri PIN

# PIN_CODE_SAVED
source: PIN code is saved!
uz: PIN kod saqlandi!

# PIN_CODE_REMOVED
source: PIN code is removed!
uz: PIN kod o'chirildi!

source: Remove PIN
uz: PIN kodni o'chirish

# CREATE_NEW_PIN
source: Create a new PIN
uz: Yangi PIN yaratish

# NEED_CAMERA_ALLOW
source: Need to allow camera usage in settings
uz: Sozlamalarda kamera foydalanishga ruxsat bering!

source: Open settings
uz: Sozlamalarni ochish

# REACTIVATE_DEALER_ALERT_TEXT
source: This client is attached to digital user %@. You can attach the previous one by deleting and confirming it.
uz: Ushbu mijoz %@ raqamli foydalanuvchiga biriktirilgan. Tasdiqlash orqali oldingisini o'chirgan holda biriktirishingiz mumkin

source: Add
uz: Biriktirish

# ALL_LOWERCASED
source: all
uz: barchasi

source: Not found
uz: Ma'lumot topilmadi

source: Invalid server response
uz: Noto'g'ri server javobi

source: Error
uz: Xatolik

source: mobile user details is not found!!!
uz: Mobil foydalanuvchi ma'lumotlari topilmadi!!!

source: Internal Server Error
uz: Ichki Serverda Xatolik

source: The username or password is wrong
uz: Telefon raqam yoki parol noto'g'ri

source: such dealer client is active
uz: Bu diler aktivlashtirilgan

source: Bad Request
uz: Noto'g'ri so'rov

# Already Exist
source: Already exists
uz: Bu akkaunt oldin ro'yxatdan o'tgan
